tiborsimon/embedded-tdd-headers/pic/pic18/pic18f8310_tdd.h
#define TRISF_RF7                     522
#define TRISG                         523
#define TRISG0                        524
#define TRISG_RG0                     525
#define TRISG1                        526
#define TRISG_RG1                     527
#define TRISG2                        528
#define TRISG_RG2                     529
#define TRISG_RG3                     530
#define TRISG3                        531
#define TRISG4                        532
#define TRISG_RG4                     533
#define TRISH                         534
#define TRISH_RH0                     535
#define TRISH0                        536
#define TRISH_RH1                     537
#define TRISH1                        538
#define TRISH_RH2                     539
#define TRISH2                        540
#define TRISH_RH3                     541
#define TRISH3                        542
#define TRISH_RH4                     543
#define TRISH4                        544
#define TRISH_RH5                     545
#define TRISH5                        546
#define TRISH_RH6                     547
#define TRISH6                        548
#define TRISH_RH7                     549
#define TRISH7                        550
#define TRISJ                         551
#define TRISJ_RJ0                     552
#define TRISJ0                        553
#define TRISJ_RJ1                     554
#define TRISJ1                        555
#define TRISJ_RJ2                     556
#define TRISJ2                        557
#define TRISJ_RJ3                     558
#define TRISJ3                        559
#define TRISJ_RJ4                     560
#define TRISJ4                        561
#define TRISJ_RJ5                     562
#define TRISJ5                        563
#define TRISJ_RJ6                     564
#define TRISJ6                        565
#define TRISJ_RJ7                     566
#define TRISJ7                        567
#define OSCTUNE                       568
#define TUN0                          569
#define TUN                           570
#define TUN1                          571
#define TUN2                          572
#define TUN3                          573
#define TUN4                          574
#define PLLEN                         575
#define INTSRC                        576
#define MEMCON                        577
#define WM                            578
#define WM0                           579
#define WM1                           580
#define WAIT0                         581
#define WAIT                          582
#define WAIT1                         583
#define EBDIS                         584
#define PIE1                          585
#define TMR1IE                        586
#define TMR2IE                        587
#define CCP1IE                        588
#define SSPIE                         589
#define TXIE                          590
#define TX1IE                         591
#define RCIE                          592
#define RC1IE                         593
#define ADIE                          594
#define PSPIE                         595
#define PIR1                          596
#define TMR1IF                        597
#define TMR2IF                        598
#define CCP1IF                        599
#define SSPIF                         600
#define TXIF                          601
#define TX1IF                         602
#define RCIF                          603
#define RC1IF                         604
#define ADIF                          605
#define PSPIF                         606
#define IPR1                          607
#define TMR1IP                        608
#define TMR2IP                        609
#define CCP1IP                        610
#define SSPIP                         611
#define TX1IP                         612
#define TXIP                          613
#define RC1IP                         614
#define RCIP                          615
#define ADIP                          616
#define PSPIP                         617
#define PIE2                          618
#define CCP2IE                        619
#define TMR3IE                        620
#define HLVDIE                        621
#define LVDIE                         622
#define BCLIE                         623
#define CMIE                          624
#define OSCFIE                        625
#define PIR2                          626
#define CCP2IF                        627
#define TMR3IF                        628
#define HLVDIF                        629
#define LVDIF                         630
#define BCLIF                         631
#define CMIF                          632
#define OSCFIF                        633
#define IPR2                          634
#define CCP2IP                        635
#define TMR3IP                        636
#define HLVDIP                        637
#define LVDIP                         638
#define BCLIP                         639
#define CMIP                          640
#define OSCFIP                        641
#define PIE3                          642
#define CCP3IE                        643
#define RXB0IE                        644
#define TXB2IE                        645
#define TXBNIE                        646
#define TX2IE                         647
#define RC2IE                         648
#define PIR3                          649
#define CCP3IF                        650
#define TX2IF                         651
#define TXBNIF                        652
#define RC2IF                         653
#define IPR3                          654
#define CCP3IP                        655
#define TXBNIP                        656
#define TX2IP                         657
#define RC2IP                         658
#define RCSTA1                        659
#define RCSTA1_RX9D                   660
#define RX9D1                         661
#define RCSTA1_RCD8                   662
#define RCSTA1_OERR                   663
#define OERR1                         664
#define RCSTA1_FERR                   665
#define FERR1                         666
#define RCSTA1_ADDEN                  667
#define RCSTA1_ADEN                   668
#define ADDEN1                        669
#define RCSTA1_CREN                   670
#define CREN1                         671
#define SRENA                         672
#define SREN1                         673
#define RCSTA1_SREN                   674
#define RCSTA1_RC9                    675
#define RCSTA1_RC8_9                  676
#define RCSTA1_RX9                    677
#define RX91                          678
#define RCSTA1_SPEN                   679
#define SPEN1                         680
#define TXSTA1                        681
#define TX9D1                         682
#define TXSTA1_TX9D                   683
#define TXSTA1_TXD8                   684
#define TRMT1                         685
#define TXSTA1_TRMT                   686
#define BRGH1                         687
#define TXSTA1_BRGH                   688
#define SENDB1                        689
#define SENDB                         690
#define TXSTA1_SYNC                   691
#define SYNC1                         692
#define TXEN1                         693
#define TXSTA1_TXEN                   694
#define TX91                          695
#define TXSTA1_TX8_9                  696
#define TXSTA1_TX9                    697
#define TXSTA1_CSRC                   698
#define CSRC1                         699
#define PSPCON                        700
#define PSPMODE                       701
#define IBOV                          702
#define OBF                           703
#define IBF                           704
#define T3CON                         705
#define TMR3ON                        706
#define TMR3CS                        707
#define nT3SYNC                       708
#define NOT_T3SYNC                    709
#define T3SYNC                        710
#define T3INSYNC                      711
#define SOSCEN3                       712
#define T3CCP1                        713
#define T3CKPS                        714
#define T3CKPS0                       715
#define T3CKPS1                       716
#define T3CCP2                        717
#define T3CON_RD16                    718
#define RD163                         719
#define T3RD16                        720
#define CMCON                         721
#define CM                            722
#define CMEN0                         723
#define CM0                           724
#define CMEN1                         725
#define CM1                           726
#define CMEN2                         727
#define CM2                           728
#define CIS                           729
#define C1INV                         730
#define C2INV                         731
#define C1OUT                         732
#define C2OUT                         733
#define CVRCON                        734
#define CVR                           735
#define CVR0                          736
#define CVR1                          737
#define CVR2                          738
#define CVR3                          739
#define CVRSS                         740
#define CVREF                         741
#define CVRR                          742
#define CVROEN                        743
#define CVROE                         744
#define CVREN                         745
#define CCP3CON                       746
#define CCP3M                         747
#define CCP3M0                        748
#define CCP3M1                        749
#define CCP3M2                        750
#define CCP3M3                        751
#define DCCP3Y                        752
#define DC3B                          753
#define DC3B0                         754
#define DCCP3X                        755
#define DC3B1                         756
#define CCP2CON                       757
#define CCP2M                         758
#define CCP2M0                        759
#define CCP2M1                        760
#define CCP2M2                        761
#define CCP2M3                        762
#define DC2B0                         763
#define DCCP2Y                        764
#define CCP2Y                         765
#define DC2B                          766
#define DC2B1                         767
#define DCCP2X                        768
#define CCP2X                         769
#define CCP1CON                       770
#define CCP1M0                        771
#define CCP1M                         772
#define CCP1M1                        773
#define CCP1M2                        774
#define CCP1M3                        775
#define DCCP1Y                        776
#define CCP1Y                         777
#define DC1B                          778
#define DC1B0                         779
#define CCP1X                         780
#define DCCP1X                        781
#define DC1B1                         782
#define ADCON2                        783
#define ADCS0                         784
#define ADCS                          785
#define ADCS1                         786
#define ADCS2                         787
#define ACQT0                         788
#define ACQT                          789
#define ACQT1                         790
#define ACQT2                         791
#define ADFM                          792
#define ADCON1                        793
#define PCFG0                         794
#define PCFG                          795
#define PCFG1                         796
#define PCFG2                         797
#define CHSN3                         798
#define PCFG3                         799
#define VCFG                          800
#define VCFG0                         801
#define VCFG01                        802
#define VCFG11                        803
#define VCFG1                         804
#define ADCON0                        805
#define ADON                          806
#define nDONE                         807
#define GO_nDONE                      808
#define NOT_DONE                      809
#define GODONE                        810
#define GO_DONE                       811
#define DONE                          812
#define GO_NOT_DONE                   813
#define GO                            814
#define CHS0                          815
#define CHS                           816
#define CHS1                          817
#define CHS2                          818
#define CHS3                          819
#define SSPCON2                       820
#define SEN                           821
#define RSEN                          822
#define PEN                           823
#define RCEN                          824
#define ACKEN                         825
#define ACKDT                         826
#define ACKSTAT                       827
#define GCEN                          828
#define SSPCON1                       829
#define SSPM0                         830
#define SSPM                          831
#define SSPM1                         832
#define SSPM2                         833
#define SSPM3                         834
#define CKP                           835
#define SSPEN                         836
#define SSPOV                         837
#define WCOL                          838
#define SSPSTAT                       839
#define BF                            840
#define UA                            841
#define R_NOT_W                       842
#define READ_WRITE                    843
#define NOT_W                         844
#define R_W                           845
#define nW                            846
#define RW                            847
#define nWRITE                        848
#define R                             849
#define NOT_WRITE                     850
#define R_nW                          851
#define I2C_READ                      852
#define START                         853
#define S                             854
#define I2C_START                     855
#define STOP                          856
#define I2C_STOP                      857
#define P                             858
#define NOT_A                         859
#define DATA_ADDRESS                  860
#define nA                            861
#define D_A                           862
#define D_nA                          863
#define D                             864
#define DA                            865
#define D_NOT_A                       866
#define NOT_ADDRESS                   867
#define nADDRESS                      868
#define I2C_DAT                       869
#define CKE                           870
#define SMP                           871
#define T2CON                         872
#define T2CKPS0                       873
#define T2CKPS                        874
#define T2CKPS1                       875
#define TMR2ON                        876
#define T2OUTPS0                      877
#define TOUTPS                        878
#define T2OUTPS1                      879
#define T2OUTPS2                      880
#define T2OUTPS3                      881
#define T1CON                         882
#define TMR1ON                        883
#define TMR1CS                        884
#define NOT_T1SYNC                    885
#define T1SYNC                        886
#define nT1SYNC                       887
#define T1INSYNC                      888
#define T1OSCEN                       889
#define SOSCEN                        890
#define T1CKPS0                       891
#define T1CKPS                        892
#define T1CKPS1                       893
#define T1RUN                         894
#define T1RD16                        895
#define T1CON_RD16                    896
#define RCON                          897
#define BOR                           898
#define NOT_BOR                       899
#define nBOR                          900
#define POR                           901
#define nPOR                          902
#define NOT_POR                       903
#define PD                            904
#define nPD                           905
#define NOT_PD                        906
#define NOT_TO                        907
#define nTO                           908
#define TO                            909
#define nRI                           910
#define NOT_RI                        911
#define RI                            912
#define SBOREN                        913
#define IPEN                          914
#define WDTCON                        915
#define SWDTE                         916
#define SWDTEN                        917
#define HLVDCON                       918
#define HLVDL                         919
#define HLVDL0                        920
#define LVV0                          921
#define LVDL0                         922
#define HLVDL1                        923
#define LVV1                          924
#define LVDL1                         925
#define HLVDL2                        926
#define LVV2                          927
#define LVDL2                         928
#define HLVDL3                        929
#define LVV3                          930
#define LVDL3                         931
#define HLVDEN                        932
#define LVDEN                         933
#define BGST                          934
#define IRVST                         935
#define VDIRMAG                       936
#define OSCCON                        937
#define SCS0                          938
#define SCS                           939
#define SCS1                          940
#define FLTS                          941
#define IOFS                          942
#define OSTS                          943
#define IRCF                          944
#define IRCF0                         945
#define IRCF1                         946
#define IRCF2                         947
#define IDLEN                         948
#define T0CON                         949
#define T0PS                          950
#define T0PS0                         951
#define T0PS1                         952
#define T0PS2                         953
#define PSA                           954
#define T0SE                          955
#define T0CS                          956
#define T08BIT                        957
#define TMR0ON                        958
#define STATUS                        959
#define C                             960
#define CARRY                         961
#define DC                            962
#define ZERO                          963
#define Z                             964
#define OV                            965
#define OVERFLOW                      966
#define N                             967
#define NEGATIVE                      968
#define INTCON3                       969
#define INT1IF                        970
#define INT1F                         971
#define INT2IF                        972
#define INT2F                         973
#define INT3F                         974
#define INT3IF                        975
#define INT1E                         976
#define INT1IE                        977
#define INT2IE                        978
#define INT2E                         979
#define INT3E                         980
#define INT3IE                        981
#define INT1P                         982
#define INT1IP                        983
#define INT2IP                        984
#define INT2P                         985
#define INTCON2                       986
#define RBIP                          987
#define INT3IP                        988
#define INT3P                         989
#define TMR0IP                        990
#define T0IP                          991
#define INTEDG3                       992
#define INTEDG2                       993
#define INTEDG1                       994
#define INTEDG0                       995
#define RBPU                          996
#define NOT_RBPU                      997
#define nRBPU                         998
#define INTCON                        999
#define RBIF                          1000
#define INT0F                         1001
#define INT0IF                        1002
#define T0IF                          1003
#define TMR0IF                        1004
#define RBIE                          1005
#define INT0E                         1006
#define INT0IE                        1007
#define T0IE                          1008
#define TMR0IE                        1009
#define PEIE                          1010
#define PEIE_GIEL                     1011
#define GIEL                          1012
#define GIE_GIEH                      1013
#define GIE                           1014
#define GIEH                          1015
#define STKPTR0                       1016
#define STKPTR                        1017
#define STKPTR1                       1018
#define STKPTR2                       1019
#define STKPTR3                       1020
#define STKPTR4                       1021
#define STKUNF                        1022
#define STKOVF                        1023
#define STKFUL                        1024

#endif // _PIC18F8310_H_
